iNavFlight/inav/lib/main/ChibiOS/community/os/hal/ports/STM32/LLD/DMA2Dv1/hal_stm32_dma2d.c
/*
    Copyright (C) 2013-2015 Andrea Zoppi

    Licensed under the Apache License, Version 2.0 (the "License");
    you may not use this file except in compliance with the License.
    You may obtain a copy of the License at

        http://www.apache.org/licenses/LICENSE-2.0

    Unless required by applicable law or agreed to in writing, software
    distributed under the License is distributed on an "AS IS" BASIS,
    WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
    See the License for the specific language governing permissions and
    limitations under the License.
*/

/**
 * @file    stm32_dma2d.c
 * @brief   DMA2D/Chrom-ART driver.
 */

#include "ch.h"
#include "hal.h"

#include "hal_stm32_dma2d.h"

#if STM32_DMA2D_USE_DMA2D || defined(__DOXYGEN__)

/* Ignore annoying warning messages for actually safe code.*/
#if defined(__GNUC__) && !defined(__DOXYGEN__)
#pragma GCC diagnostic ignored "-Wtype-limits"
#endif

/**
 * @addtogroup dma2d
 * @{
 */

/*===========================================================================*/
/* Driver local definitions.                                                 */
/*===========================================================================*/

/*===========================================================================*/
/* Driver exported variables.                                                */
/*===========================================================================*/

/** @brief DMA2DD1 driver identifier.*/
DMA2DDriver DMA2DD1;

/*===========================================================================*/
/* Driver local variables and types.                                         */
/*===========================================================================*/

/**
 * @brief   Bits per pixel lookup table.
 */
static const uint8_t dma2d_bpp[DMA2D_MAX_PIXFMT_ID + 1] = {
  32,  /* DMA2D_FMT_ARGB8888 */
  24,  /* DMA2D_FMT_RGB888 */
  16,  /* DMA2D_FMT_RGB565 */
  16,  /* DMA2D_FMT_ARGB1555 */
  16,  /* DMA2D_FMT_ARGB4444 */
   8,  /* DMA2D_FMT_L8 */
   8,  /* DMA2D_FMT_AL44 */
  16,  /* DMA2D_FMT_AL88 */
   4,  /* DMA2D_FMT_L4 */
   8,  /* DMA2D_FMT_A8 */
   4   /* DMA2D_FMT_A4 */
};

/*===========================================================================*/
/* Driver local functions.                                                   */
/*===========================================================================*/

/*===========================================================================*/
/* Driver exported functions.                                                */
/*===========================================================================*/

/**
 * @name    DMA2D interrupt handlers
 * @{
 */

/**
 * @brief   DMA2D global interrupt handler.
 *
 * @isr
 */
OSAL_IRQ_HANDLER(STM32_DMA2D_HANDLER) {

  DMA2DDriver *const dma2dp = &DMA2DD1;
  bool job_done = false;
  thread_t *tp = NULL;

  OSAL_IRQ_PROLOGUE();

  /* Handle Configuration Error ISR.*/
  if ((DMA2D->ISR & DMA2D_ISR_CEIF) && (DMA2D->CR & DMA2D_CR_CEIE)) {
    if (dma2dp->config->cfgerr_isr != NULL)
      dma2dp->config->cfgerr_isr(dma2dp);
    job_done = true;
    DMA2D->IFCR |= DMA2D_IFSR_CCEIF;
  }

  /* Handle CLUT (Palette) Transfer Complete ISR.*/
  if ((DMA2D->ISR & DMA2D_ISR_CTCIF) && (DMA2D->CR & DMA2D_CR_CTCIE)) {
    if (dma2dp->config->paltrfdone_isr != NULL)
      dma2dp->config->paltrfdone_isr(dma2dp);
    job_done = true;
    DMA2D->IFCR |= DMA2D_IFSR_CCTCIF;
  }

  /* Handle CLUT (Palette) Access Error ISR.*/
  if ((DMA2D->ISR & DMA2D_ISR_CAEIF) && (DMA2D->CR & DMA2D_CR_CAEIE)) {
    if (dma2dp->config->palacserr_isr != NULL)
      dma2dp->config->palacserr_isr(dma2dp);
    job_done = true;
    DMA2D->IFCR |= DMA2D_IFSR_CCAEIF;
  }

  /* Handle Transfer Watermark ISR.*/
  if ((DMA2D->ISR & DMA2D_ISR_TWIF) && (DMA2D->CR & DMA2D_CR_TWIE)) {
    if (dma2dp->config->trfwmark_isr != NULL)
      dma2dp->config->trfwmark_isr(dma2dp);
    DMA2D->IFCR |= DMA2D_IFSR_CTWIF;
  }

  /* Handle Transfer Complete ISR.*/
  if ((DMA2D->ISR & DMA2D_ISR_TCIF) && (DMA2D->CR & DMA2D_CR_TCIE)) {
    if (dma2dp->config->trfdone_isr != NULL)
      dma2dp->config->trfdone_isr(dma2dp);
    job_done = true;
    DMA2D->IFCR |= DMA2D_IFSR_CTCIF;
  }

  /* Handle Transfer Error ISR.*/
  if ((DMA2D->ISR & DMA2D_ISR_TEIF) && (DMA2D->CR & DMA2D_CR_TEIE)) {
    if (dma2dp->config->trferr_isr != NULL)
      dma2dp->config->trferr_isr(dma2dp);
    job_done = true;
    DMA2D->IFCR |= DMA2D_IFSR_CTEIF;
  }

  if (job_done) {
    osalSysLockFromISR();
    osalDbgAssert(dma2dp->state == DMA2D_ACTIVE, "invalid state");

  #if DMA2D_USE_WAIT
    /* Wake the waiting thread up.*/
    if (dma2dp->thread != NULL) {
      tp = dma2dp->thread;
      dma2dp->thread = NULL;
      tp->u.rdymsg = MSG_OK;
      chSchReadyI(tp);
    }
  #endif  /* DMA2D_USE_WAIT */

    dma2dp->state = DMA2D_READY;
    osalSysUnlockFromISR();
  }

  OSAL_IRQ_EPILOGUE();
}

/** @} */

/**
 * @name    DMA2D driver-specific methods
 * @{
 */

/**
 * @brief   DMA2D Driver initialization.
 * @details Initializes the DMA2D subsystem and chosen drivers. Should be
 *          called at board initialization.
 *
 * @init
 */
void dma2dInit(void) {

  /* Reset the DMA2D hardware module.*/
  rccResetDMA2D();

  /* Enable the DMA2D clock.*/
  rccEnableDMA2D(false);

  /* Driver struct initialization.*/
  dma2dObjectInit(&DMA2DD1);
  DMA2DD1.state = DMA2D_STOP;
}

/**
 * @brief   Initializes the standard part of a @p DMA2DDriver structure.
 *
 * @param[out] dma2dp   pointer to the @p DMA2DDriver object
 *
 * @init
 */
void dma2dObjectInit(DMA2DDriver *dma2dp) {

  osalDbgCheck(dma2dp == &DMA2DD1);

  dma2dp->state = DMA2D_UNINIT;
  dma2dp->config = NULL;
#if DMA2D_USE_WAIT
  dma2dp->thread = NULL;
#endif  /* DMA2D_USE_WAIT */
#if (TRUE == DMA2D_USE_MUTUAL_EXCLUSION)
#if (TRUE == CH_CFG_USE_MUTEXES)
  chMtxObjectInit(&dma2dp->lock);
#else
  chSemObjectInit(&dma2dp->lock, 1);
#endif
#endif  /* (TRUE == DMA2D_USE_MUTUAL_EXCLUSION) */
}

/**
 * @brief   Get the driver state.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 *
 * @retun               driver state
 *
 * @iclass
 */
dma2d_state_t dma2dGetStateI(DMA2DDriver *dma2dp) {

  osalDbgCheck(dma2dp == &DMA2DD1);
  osalDbgCheckClassI();

  return dma2dp->state;
}

/**
 * @brief   Get the driver state.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 *
 * @retun               driver state
 *
 * @api
 */
dma2d_state_t dma2dGetState(DMA2DDriver *dma2dp) {

  dma2d_state_t state;
  chSysLock();
  state = dma2dGetStateI(dma2dp);
  chSysUnlock();
  return state;
}

/**
 * @brief   Configures and activates the DMA2D peripheral.
 * @pre     DMA2D is stopped.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 * @param[in] configp   pointer to the @p DMA2DConfig object
 *
 * @api
 */
void dma2dStart(DMA2DDriver *dma2dp, const DMA2DConfig *configp) {

  chSysLock();

  osalDbgCheck(dma2dp == &DMA2DD1);
  osalDbgCheck(configp != NULL);
  osalDbgAssert(dma2dp->state == DMA2D_STOP, "invalid state");

