iNavFlight/inav/lib/main/ChibiOS/community/os/hal/ports/STM32/LLD/DMA2Dv1/hal_stm32_dma2d.c
  dma2dp->config = configp;

  /* Turn off the controller and its interrupts.*/
  DMA2D->CR = 0;

  /* Enable interrupts, except Line Watermark.*/
  nvicEnableVector(STM32_DMA2D_NUMBER, STM32_DMA2D_IRQ_PRIORITY);

  DMA2D->CR = (DMA2D_CR_CEIE | DMA2D_CR_CTCIE | DMA2D_CR_CAEIE |
               DMA2D_CR_TCIE | DMA2D_CR_TEIE);

  dma2dp->state = DMA2D_READY;
  chSysUnlock();
}

/**
 * @brief   Deactivates the DMA2D peripheral.
 * @pre     DMA2D is ready.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 *
 * @api
 */
void dma2dStop(DMA2DDriver *dma2dp) {

  chSysLock();

  osalDbgCheck(dma2dp == &DMA2DD1);
  osalDbgAssert(dma2dp->state == DMA2D_READY, "invalid state");
#if DMA2D_USE_WAIT
  osalDbgAssert(dma2dp->thread == NULL, "still waiting");
#endif  /* DMA2D_USE_WAIT */

  dma2dp->state = DMA2D_STOP;
  chSysUnlock();
}

#if DMA2D_USE_MUTUAL_EXCLUSION

/**
 * @brief   Gains exclusive access to the DMA2D module.
 * @details This function tries to gain ownership to the DMA2D module, if the
 *          module is already being used then the invoking thread is queued.
 * @pre     In order to use this function the option
 *          @p DMA2D_USE_MUTUAL_EXCLUSION must be enabled.
 * @pre     DMA2D is ready.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 *
 * @sclass
 */
void dma2dAcquireBusS(DMA2DDriver *dma2dp) {

  osalDbgCheckClassS();
  osalDbgCheck(dma2dp == &DMA2DD1);
  osalDbgAssert(dma2dp->state == DMA2D_READY, "not ready");

#if (TRUE == CH_CFG_USE_MUTEXES)
  chMtxLockS(&dma2dp->lock);
#else
  chSemWaitS(&dma2dp->lock);
#endif
}

/**
 * @brief   Gains exclusive access to the DMA2D module.
 * @details This function tries to gain ownership to the DMA2D module, if the
 *          module is already being used then the invoking thread is queued.
 * @pre     In order to use this function the option
 *          @p DMA2D_USE_MUTUAL_EXCLUSION must be enabled.
 * @pre     DMA2D is ready.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 *
 * @api
 */
void dma2dAcquireBus(DMA2DDriver *dma2dp) {

  chSysLock();
  dma2dAcquireBusS(dma2dp);
  chSysUnlock();
}

/**
 * @brief   Releases exclusive access to the DMA2D module.
 * @pre     In order to use this function the option
 *          @p DMA2D_USE_MUTUAL_EXCLUSION must be enabled.
 * @pre     DMA2D is ready.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 *
 * @sclass
 */
void dma2dReleaseBusS(DMA2DDriver *dma2dp) {

  osalDbgCheckClassS();
  osalDbgCheck(dma2dp == &DMA2DD1);
  osalDbgAssert(dma2dp->state == DMA2D_READY, "not ready");

#if (TRUE == CH_CFG_USE_MUTEXES)
  chMtxUnlockS(&dma2dp->lock);
#else
  chSemSignalI(&dma2dp->lock);
#endif
}

/**
 * @brief   Releases exclusive access to the DMA2D module.
 * @pre     In order to use this function the option
 *          @p DMA2D_USE_MUTUAL_EXCLUSION must be enabled.
 * @pre     DMA2D is ready.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 *
 * @api
 */
void dma2dReleaseBus(DMA2DDriver *dma2dp) {

  chSysLock();
  dma2dReleaseBusS(dma2dp);
  chSysUnlock();
}

#endif  /* DMA2D_USE_MUTUAL_EXCLUSION */

/** @} */

/**
 * @name    DMA2D global methods
 * @{
 */

/**
 * @brief   Get watermark position.
 * @details Gets the watermark line position.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 *
 * @return              watermark line position
 *
 * @iclass
 */
uint16_t dma2dGetWatermarkPosI(DMA2DDriver *dma2dp) {

  osalDbgCheckClassI();
  osalDbgCheck(dma2dp == &DMA2DD1);
  (void)dma2dp;

  return (uint16_t)(DMA2D->LWR & DMA2D_LWR_LW);
}

/**
 * @brief   Get watermark position.
 * @details Gets the watermark line position.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 *
 * @return              watermark line position
 *
 * @api
 */
uint16_t dma2dGetWatermarkPos(DMA2DDriver *dma2dp) {

  uint16_t line;
  chSysLock();
  line = dma2dGetWatermarkPosI(dma2dp);
  chSysUnlock();
  return line;
}

/**
 * @brief   Set watermark position.
 * @details Sets the watermark line position.
 * @pre     DMA2D is ready.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 * @param[in] line      watermark line position
 *
 * @iclass
 */
void dma2dSetWatermarkPosI(DMA2DDriver *dma2dp, uint16_t line) {

  osalDbgCheckClassI();
  osalDbgCheck(dma2dp == &DMA2DD1);
  osalDbgAssert(dma2dp->state == DMA2D_READY, "not ready");
  (void)dma2dp;

  DMA2D->LWR = ((DMA2D->LWR & ~DMA2D_LWR_LW) |
                ((uint32_t)line & DMA2D_LWR_LW));
}

/**
 * @brief   Set watermark position.
 * @details Sets the watermark line position.
 * @note    The interrupt is invoked after the last pixel of the watermark line
 *          is written.
 * @pre     DMA2D is ready.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 * @param[in] line      watermark line position
 *
 * @iclass
 */
void dma2dSetWatermarkPos(DMA2DDriver *dma2dp, uint16_t line) {

  chSysLock();
  dma2dSetWatermarkPosI(dma2dp, line);
  chSysUnlock();
}

/**
 * @brief   Watermark interrupt enabled.
 * @details Tells whether the watermark interrupt is enabled.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 *
 * @return              enabled
 *
 * @iclass
 */
bool dma2dIsWatermarkEnabledI(DMA2DDriver *dma2dp) {

  osalDbgCheckClassI();
  osalDbgCheck(dma2dp == &DMA2DD1);
  (void)dma2dp;

  return (DMA2D->CR & DMA2D_CR_TWIE) != 0;
}

/**
 * @brief   Watermark interrupt enabled.
 * @details Tells whether the watermark interrupt is enabled.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 *
 * @return              enabled
 *
 * @api
 */
bool dma2dIsWatermarkEnabled(DMA2DDriver *dma2dp) {

  bool enabled;
  chSysLock();
  enabled = dma2dIsWatermarkEnabledI(dma2dp);
  chSysUnlock();
  return enabled;
}

/**
 * @brief   Enable watermark interrupt.
 * @details Enables the watermark interrupt. The interrupt is invoked after the
 *          last pixel of the watermark line is written to the output layer.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 *
 * @iclass
 */
void dma2dEnableWatermarkI(DMA2DDriver *dma2dp) {

  osalDbgCheckClassI();
  osalDbgCheck(dma2dp == &DMA2DD1);
  (void)dma2dp;

  DMA2D->CR |= DMA2D_CR_TWIE;
}

/**
 * @brief   Enable watermark interrupt.
 * @details Enables the watermark interrupt. The interrupt is invoked after the
 *          last pixel of the watermark line is written to the output layer.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 *
 * @api
 */
void dma2dEnableWatermark(DMA2DDriver *dma2dp) {

  chSysLock();
  dma2dEnableWatermarkI(dma2dp);
  chSysUnlock();
}

/**
 * @brief   Disable watermark interrupt.
 * @details Disables the watermark interrupt.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 *
 * @iclass
 */
void dma2dDisableWatermarkI(DMA2DDriver *dma2dp) {

  osalDbgCheckClassI();
  osalDbgCheck(dma2dp == &DMA2DD1);
  (void)dma2dp;

