iNavFlight/inav/lib/main/ChibiOS/community/os/hal/ports/STM32/LLD/DMA2Dv1/hal_stm32_dma2d.c
  DMA2D->CR &= ~DMA2D_CR_TWIE;
}

/**
 * @brief   Disable watermark interrupt.
 * @details Disables the watermark interrupt.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 *
 * @api
 */
void dma2dDisableWatermark(DMA2DDriver *dma2dp) {

  chSysLock();
  dma2dDisableWatermarkI(dma2dp);
  chSysUnlock();
}

/**
 * @brief   Get dead time cycles.
 * @details Gets the minimum dead time DMA2D clock cycles between DMA2D
 *          transactions.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 *
 * @return              dead time, in DMA2D clock cycles
 *
 * @iclass
 */
uint32_t dma2dGetDeadTimeI(DMA2DDriver *dma2dp) {

  osalDbgCheckClassI();
  osalDbgCheck(dma2dp == &DMA2DD1);
  (void)dma2dp;

  return (DMA2D->AMTCR & DMA2D_AMTCR_DT) >> 8;
}

/**
 * @brief   Get dead time cycles.
 * @details Gets the minimum dead time DMA2D clock cycles between DMA2D
 *          transactions.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 *
 * @return              dead time, in DMA2D clock cycles
 *
 * @api
 */
uint32_t dma2dGetDeadTime(DMA2DDriver *dma2dp) {

  uint32_t cycles;
  chSysLock();
  cycles = dma2dGetDeadTimeI(dma2dp);
  chSysUnlock();
  return cycles;
}

/**
 * @brief   Set dead time cycles.
 * @details Sets the minimum dead time DMA2D clock cycles between DMA2D
 *          transactions.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 * @param[in] cycles    dead time, in DMA2D clock cycles
 *
 * @iclass
 */
void dma2dSetDeadTimeI(DMA2DDriver *dma2dp, uint32_t cycles) {

  osalDbgCheckClassI();
  osalDbgCheck(dma2dp == &DMA2DD1);
  osalDbgAssert(cycles <= DMA2D_MAX_DEADTIME_CYCLES, "bounds");
  (void)dma2dp;

  DMA2D->AMTCR = ((DMA2D->AMTCR & ~DMA2D_AMTCR_DT) |
                  ((cycles << 8) & DMA2D_AMTCR_DT));
}

/**
 * @brief   Set dead time cycles.
 * @details Sets the minimum dead time DMA2D clock cycles between DMA2D
 *          transactions.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 * @param[in] cycles    dead time, in DMA2D clock cycles
 *
 * @api
 */
void dma2dSetDeadTime(DMA2DDriver *dma2dp, uint32_t cycles) {

  chSysLock();
  dma2dSetDeadTimeI(dma2dp, cycles);
  chSysUnlock();
}

/**
 * @brief   Dead time enabled.
 * @details Tells whether the dead time between DMA2D transactions is enabled.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 *
 * @return              enabled
 *
 * @iclass
 */
bool dma2dIsDeadTimeEnabledI(DMA2DDriver *dma2dp) {

  osalDbgCheckClassI();
  osalDbgCheck(dma2dp == &DMA2DD1);
  (void)dma2dp;

  return (DMA2D->AMTCR & DMA2D_AMTCR_EN) != 0;
}

/**
 * @brief   Dead time enabled.
 * @details Tells whether the dead time between DMA2D transactions is enabled.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 *
 * @return              enabled
 *
 * @api
 */
bool dma2dIsDeadTimeEnabled(DMA2DDriver *dma2dp) {

  bool enabled;
  chSysLock();
  enabled = dma2dIsDeadTimeEnabledI(dma2dp);
  chSysUnlock();
  return enabled;
}

/**
 * @brief   Enable dead time.
 * @details Enables the dead time between DMA2D transactions.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 *
 * @iclass
 */
void dma2dEnableDeadTimeI(DMA2DDriver *dma2dp) {

  osalDbgCheckClassI();
  osalDbgCheck(dma2dp == &DMA2DD1);
  (void)dma2dp;

  DMA2D->AMTCR |= DMA2D_AMTCR_EN;
}

/**
 * @brief   Enable dead time.
 * @details Enables the dead time between DMA2D transactions.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 *
 * @api
 */
void dma2dEnableDeadTime(DMA2DDriver *dma2dp) {

  chSysLock();
  dma2dEnableDeadTimeI(dma2dp);
  chSysUnlock();
}

/**
 * @brief   Disable dead time.
 * @details Disables the dead time between DMA2D transactions.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 *
 * @iclass
 */
void dma2dDisableDeadTimeI(DMA2DDriver *dma2dp) {

  osalDbgCheckClassI();
  osalDbgCheck(dma2dp == &DMA2DD1);
  (void)dma2dp;

  DMA2D->AMTCR &= ~DMA2D_AMTCR_EN;
}

/**
 * @brief   Disable dead time.
 * @details Disables the dead time between DMA2D transactions.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 *
 * @api
 */
void dma2dDisableDeadTime(DMA2DDriver *dma2dp) {

  chSysLock();
  dma2dDisableDeadTimeI(dma2dp);
  chSysUnlock();
}

/** @} */

/**
 * @name    DMA2D job (transaction) methods
 * @{
 */

/**
 * @brief   Get job mode.
 * @details Gets the job mode.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 *
 * @return              job mode
 *
 * @iclass
 */
dma2d_jobmode_t dma2dJobGetModeI(DMA2DDriver *dma2dp) {

  osalDbgCheckClassI();
  osalDbgCheck(dma2dp == &DMA2DD1);
  (void)dma2dp;

  return (dma2d_jobmode_t)(DMA2D->CR & DMA2D_CR_MODE);
}

/**
 * @brief   Get job mode.
 * @details Gets the job mode.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 *
 * @return              job mode
 *
 * @api
 */
dma2d_jobmode_t dma2dJobGetMode(DMA2DDriver *dma2dp) {

  dma2d_jobmode_t mode;
  chSysLock();
  mode = dma2dJobGetModeI(dma2dp);
  chSysUnlock();
  return mode;
}

/**
 * @brief   Set job mode.
 * @details Sets the job mode.
 * @pre     DMA2D is ready.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 * @param[in] mode      job mode
 *
 * @iclass
 */
void dma2dJobSetModeI(DMA2DDriver *dma2dp, dma2d_jobmode_t mode) {

  osalDbgCheckClassI();
  osalDbgCheck(dma2dp == &DMA2DD1);
  osalDbgAssert(dma2dp->state == DMA2D_READY, "not ready");
  osalDbgAssert((mode & ~DMA2D_CR_MODE) == 0, "bounds");
  (void)dma2dp;

  DMA2D->CR = ((DMA2D->CR & ~DMA2D_CR_MODE) |
               ((uint32_t)mode & DMA2D_CR_MODE));
}

/**
 * @brief   Set job mode.
 * @details Sets the job mode.
 * @pre     DMA2D is ready.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 * @param[in] mode      job mode
 *
 * @api
 */
void dma2dJobSetMode(DMA2DDriver *dma2dp, dma2d_jobmode_t mode) {

  chSysLock();
  dma2dJobSetModeI(dma2dp, mode);
  chSysUnlock();
}

/**
 * @brief   Get job size.
 * @details Gets the job size.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 * @param[out] widthp   pointer to the job width, in pixels
 * @param[out] heightp  pointer to the job height, in pixels
 *
 * @iclass
 */
void dma2dJobGetSizeI(DMA2DDriver *dma2dp,
                      uint16_t *widthp, uint16_t *heightp) {

  uint32_t r;

  osalDbgCheckClassI();
  osalDbgCheck(dma2dp == &DMA2DD1);
  osalDbgCheck(widthp != NULL);
  osalDbgCheck(heightp != NULL);
  (void)dma2dp;

  r = DMA2D->NLR;
  *widthp  = (uint16_t)((r & DMA2D_NLR_PL) >> 16);
  *heightp = (uint16_t)((r & DMA2D_NLR_NL) >>  0);
}

/**
 * @brief   Get job size.
 * @details Gets the job size.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 * @param[out] widthp   pointer to the job width, in pixels
 * @param[out] heightp  pointer to the job height, in pixels
 *
 * @api
 */
void dma2dJobGetSize(DMA2DDriver *dma2dp,
                     uint16_t *widthp, uint16_t *heightp) {

  chSysLock();
  dma2dJobGetSizeI(dma2dp, widthp, heightp);
  chSysUnlock();
}

/**
 * @brief   Set job size.
 * @details Sets the job size.
 * @pre     DMA2D is ready.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 * @param[in] widthp    job width, in pixels
 * @param[in] heightp   job height, in pixels
 *
 * @iclass
 */
void dma2dJobSetSizeI(DMA2DDriver *dma2dp, uint16_t width, uint16_t height) {

  osalDbgCheckClassI();
  osalDbgCheck(dma2dp == &DMA2DD1);
  osalDbgAssert(dma2dp->state == DMA2D_READY, "not ready");
  osalDbgAssert(width <= DMA2D_MAX_WIDTH, "bounds");
  osalDbgAssert(height <= DMA2D_MAX_HEIGHT, "bounds");
  (void)dma2dp;

  DMA2D->NLR = ((((uint32_t)width  << 16) & DMA2D_NLR_PL) |
                (((uint32_t)height <<  0) & DMA2D_NLR_NL));
}

/**
 * @brief   Set job size.
 * @details Sets the job size.
 * @pre     DMA2D is ready.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 * @param[in] widthp    job width, in pixels
 * @param[in] heightp   job height, in pixels
 *
 * @api
 */
void dma2dJobSetSize(DMA2DDriver *dma2dp, uint16_t width, uint16_t height) {

  chSysLock();
  dma2dJobSetSizeI(dma2dp, width, height);
  chSysUnlock();
}

/**
 * @brief   Job executing.
 * @details Tells whether a job (transaction) is active or paused.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 *
 * @return              executing
 *
 * @iclass
 */
bool dma2dJobIsExecutingI(DMA2DDriver *dma2dp) {

  osalDbgCheckClassI();
  osalDbgCheck(dma2dp == &DMA2DD1);

  return dma2dp->state > DMA2D_READY;
}

/**
 * @brief   Job executing.
 * @details Tells whether a job (transaction) is active or paused.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 *
 * @return              executing
 *
 * @api
 */
bool dma2dJobIsExecuting(DMA2DDriver *dma2dp) {

  bool executing;
  chSysLock();
  executing = dma2dJobIsExecutingI(dma2dp);
  chSysUnlock();
  return executing;
}

/**
 * @brief   Start job.
 * @details The job is started, and the DMA2D is set to active.
 * @note    Should there be invalid parameters, the appropriate interrupt
 *          handler will be invoked, and the DMA2D set back to ready.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 *
 * @iclass
 */
void dma2dJobStartI(DMA2DDriver *dma2dp) {

  osalDbgCheckClassI();
  osalDbgCheck(dma2dp == &DMA2DD1);
  osalDbgAssert(dma2dp->state == DMA2D_READY, "not ready");

  dma2dp->state = DMA2D_ACTIVE;
  DMA2D->CR |= DMA2D_CR_START;
}

/**
 * @brief   Start job.
 * @details The job is started, and the DMA2D is set to active.
 * @note    Should there be invalid parameters, the appropriate interrupt
 *          handler will be invoked, and the DMA2D set back to ready.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 *
 * @api
 */
void dma2dJobStart(DMA2DDriver *dma2dp) {

  chSysLock();
  dma2dJobStartI(dma2dp);
  chSysUnlock();
}

/**
 * @brief   Execute job.
 * @details Starts the job and waits for its completion, synchronously.
 * @note    Should there be invalid parameters, the appropriate interrupt
 *          handler will be invoked, and the DMA2D set back to ready.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 *
 * @sclass
 */
void dma2dJobExecuteS(DMA2DDriver *dma2dp) {

  osalDbgCheckClassS();
  osalDbgCheck(dma2dp == &DMA2DD1);

  dma2dJobStartI(dma2dp);
#if DMA2D_USE_WAIT
  dma2dp->thread = chThdGetSelfX();
  chSchGoSleepS(CH_STATE_SUSPENDED);
#else
  while (DMA2D->CR & DMA2D_CR_START)
    chSchDoYieldS();
#endif
}

/**
 * @brief   Execute job.
 * @details Starts the job and waits for its completion, synchronously.
 * @note    Should there be invalid parameters, the appropriate interrupt
 *          handler will be invoked, and the DMA2D set back to ready.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 *
 * @api
 */
void dma2dJobExecute(DMA2DDriver *dma2dp) {

  chSysLock();
  dma2dJobExecuteS(dma2dp);
  chSysUnlock();
}

/**
 * @brief   Suspend current job.
 * @details Suspends the current job. The driver is set to a paused state.
 * @pre     There is an active job.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 *
 * @iclass
 */
void dma2dJobSuspendI(DMA2DDriver *dma2dp) {

  osalDbgCheckClassI();
  osalDbgCheck(dma2dp == &DMA2DD1);
  osalDbgCheck((DMA2D->CR & DMA2D_CR_SUSP) == 0);
  osalDbgAssert(dma2dp->state == DMA2D_ACTIVE, "invalid state");

  dma2dp->state = DMA2D_PAUSED;
  DMA2D->CR |= DMA2D_CR_SUSP;
}

/**
 * @brief   Suspend current job.
 * @details Suspends the current job. The driver is set to a paused state.
 * @pre     There is an active job.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 *
 * @api
 */
void dma2dJobSuspend(DMA2DDriver *dma2dp) {

  chSysLock();
  dma2dJobSuspendI(dma2dp);
  chSysUnlock();
}

/**
 * @brief   Resume current job.
 * @details Resumes the current job.
 * @pre     There is a paused job.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 *
 * @iclass
 */
void dma2dJobResumeI(DMA2DDriver *dma2dp) {

  osalDbgCheckClassI();
  osalDbgCheck(dma2dp == &DMA2DD1);
  osalDbgCheck((DMA2D->CR & DMA2D_CR_SUSP) != 0);
  osalDbgAssert(dma2dp->state == DMA2D_PAUSED, "invalid state");

  dma2dp->state = DMA2D_ACTIVE;
  DMA2D->CR &= ~DMA2D_CR_SUSP;
}

/**
 * @brief   Resume current job.
 * @details Resumes the current job.
 * @pre     There is a paused job.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 *
 * @api
 */
void dma2dJobResume(DMA2DDriver *dma2dp) {

  chSysLock();
  dma2dJobResumeI(dma2dp);
  chSysUnlock();
}

/**
 * @brief   Abort current job.
 * @details Abots the current job (if any), and the driver becomes ready.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 *
 * @iclass
 */
void dma2dJobAbortI(DMA2DDriver *dma2dp) {

  osalDbgCheckClassI();
  osalDbgCheck(dma2dp == &DMA2DD1);
  osalDbgCheck((DMA2D->CR & DMA2D_CR_SUSP) == 0);
  osalDbgAssert(dma2dp->state >= DMA2D_READY, "invalid state");

  dma2dp->state = DMA2D_READY;
  DMA2D->CR |= DMA2D_CR_ABORT;
}

/**
 * @brief   Abort current job.
 * @details Abots the current job (if any), and the driver becomes ready.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 *
 * @api
 */
void dma2dJobAbort(DMA2DDriver *dma2dp) {

  chSysLock();
  dma2dJobAbortI(dma2dp);
  chSysUnlock();
}

/** @} */

/**
 * @name    DMA2D background layer methods
 * @{
 */

/**
 * @brief   Get background layer buffer address.
 * @details Gets the buffer address of the background layer.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 *
 * @return              buffer address
 *
 * @iclass
 */
void *dma2dBgGetAddressI(DMA2DDriver *dma2dp) {

  osalDbgCheckClassI();
  osalDbgCheck(dma2dp == &DMA2DD1);
  (void)dma2dp;

  return (void *)DMA2D->BGMAR;
}

/**
 * @brief   Get background layer buffer address.
 * @details Gets the buffer address of the background layer.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 *
 * @return              buffer address
 *
 * @api
 */
void *dma2dBgGetAddress(DMA2DDriver *dma2dp) {

