iNavFlight/inav/lib/main/ChibiOS/community/os/hal/ports/STM32/LLD/DMA2Dv1/hal_stm32_dma2d.c
  void *bufferp;
  chSysLock();
  bufferp = dma2dBgGetAddressI(dma2dp);
  chSysUnlock();
  return bufferp;
}

/**
 * @brief   Set background layer buffer address.
 * @details Sets the buffer address of the background layer.
 * @pre     DMA2D is ready.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 * @param[in] bufferp   buffer address
 *
 * @iclass
 */
void dma2dBgSetAddressI(DMA2DDriver *dma2dp, void *bufferp) {

  osalDbgCheckClassI();
  osalDbgCheck(dma2dp == &DMA2DD1);
  osalDbgAssert(dma2dp->state == DMA2D_READY, "not ready");
  osalDbgCheck(dma2dIsAligned(bufferp, dma2dBgGetPixelFormatI(dma2dp)));
  (void)dma2dp;

  DMA2D->BGMAR = (uint32_t)bufferp;
}

/**
 * @brief   Set background layer buffer address.
 * @details Sets the buffer address of the background layer.
 * @pre     DMA2D is ready.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 * @param[in] bufferp   buffer address
 *
 * @api
 */
void dma2dBgSetAddress(DMA2DDriver *dma2dp, void *bufferp) {

  chSysLock();
  dma2dBgSetAddressI(dma2dp, bufferp);
  chSysUnlock();
}

/**
 * @brief   Get background layer wrap offset.
 * @details Gets the buffer line wrap offset of the background layer.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 *
 * @return              wrap offset, in pixels
 *
 * @iclass
 */
size_t dma2dBgGetWrapOffsetI(DMA2DDriver *dma2dp) {

  osalDbgCheckClassI();
  osalDbgCheck(dma2dp == &DMA2DD1);
  (void)dma2dp;

  return (size_t)(DMA2D->BGOR & DMA2D_BGOR_LO);
}

/**
 * @brief   Get background layer wrap offset.
 * @details Gets the buffer line wrap offset of the background layer.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 *
 * @return              wrap offset, in pixels
 *
 * @api
 */
size_t dma2dBgGetWrapOffset(DMA2DDriver *dma2dp) {

  size_t offset;
  chSysLock();
  offset = dma2dBgGetWrapOffsetI(dma2dp);
  chSysUnlock();
  return offset;
}

/**
 * @brief   Set background layer wrap offset.
 * @details Sets the buffer line wrap offset of the background layer.
 * @pre     DMA2D is ready.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 * @param[in] offset    wrap offset, in pixels
 *
 * @iclass
 */
void dma2dBgSetWrapOffsetI(DMA2DDriver *dma2dp, size_t offset) {

  osalDbgCheckClassI();
  osalDbgCheck(dma2dp == &DMA2DD1);
  osalDbgAssert(dma2dp->state == DMA2D_READY, "not ready");
  osalDbgAssert(offset <= DMA2D_MAX_OFFSET, "bounds");
  (void)dma2dp;

  DMA2D->BGOR = ((DMA2D->BGOR & ~DMA2D_BGOR_LO) |
                 ((uint32_t)offset & DMA2D_BGOR_LO));
}

/**
 * @brief   Set background layer wrap offset.
 * @details Sets the buffer line wrap offset of the background layer.
 * @pre     DMA2D is ready.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 * @param[in] offset    wrap offset, in pixels
 *
 * @api
 */
void dma2dBgSetWrapOffset(DMA2DDriver *dma2dp, size_t offset) {

  chSysLock();
  dma2dBgSetWrapOffsetI(dma2dp, offset);
  chSysUnlock();
}

/**
 * @brief   Get background layer constant alpha.
 * @details Gets the constant alpha component of the background layer.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 *
 * @return              constant alpha component, A-8
 *
 * @iclass
 */
uint8_t dma2dBgGetConstantAlphaI(DMA2DDriver *dma2dp) {

  osalDbgCheckClassI();
  osalDbgCheck(dma2dp == &DMA2DD1);
  (void)dma2dp;

  return (uint8_t)((DMA2D->BGPFCCR & DMA2D_BGPFCCR_ALPHA) >> 24);
}

/**
 * @brief   Get background layer constant alpha.
 * @details Gets the constant alpha component of the background layer.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 *
 * @return              constant alpha component, A-8
 *
 * @api
 */
uint8_t dma2dBgGetConstantAlpha(DMA2DDriver *dma2dp) {

  uint8_t a;
  chSysLock();
  a = dma2dBgGetConstantAlphaI(dma2dp);
  chSysUnlock();
  return a;
}

/**
 * @brief   Set background layer constant alpha.
 * @details Sets the constant alpha component of the background layer.
 * @pre     DMA2D is ready.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 * @param[in] a         constant alpha component, A-8
 *
 * @iclass
 */
void dma2dBgSetConstantAlphaI(DMA2DDriver *dma2dp, uint8_t a) {

  osalDbgCheckClassI();
  osalDbgCheck(dma2dp == &DMA2DD1);
  osalDbgAssert(dma2dp->state == DMA2D_READY, "not ready");
  (void)dma2dp;

  DMA2D->BGPFCCR = ((DMA2D->BGPFCCR & ~DMA2D_BGPFCCR_ALPHA) |
                    (((uint32_t)a << 24) & DMA2D_BGPFCCR_ALPHA));
}

/**
 * @brief   Set background layer constant alpha.
 * @details Sets the constant alpha component of the background layer.
 * @pre     DMA2D is ready.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 * @param[in] a         constant alpha component, A-8
 *
 * @api
 */
void dma2dBgSetConstantAlpha(DMA2DDriver *dma2dp, uint8_t a) {

  chSysLock();
  dma2dBgSetConstantAlphaI(dma2dp, a);
  chSysUnlock();
}

/**
 * @brief   Get background layer alpha mode.
 * @details Gets the alpha mode of the background layer.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 *
 * @return              alpha mode
 *
 * @iclass
 */
dma2d_amode_t dma2dBgGetAlphaModeI(DMA2DDriver *dma2dp) {

  osalDbgCheckClassI();
  osalDbgCheck(dma2dp == &DMA2DD1);
  (void)dma2dp;

  return (dma2d_amode_t)(DMA2D->BGPFCCR & DMA2D_BGPFCCR_AM);
}

/**
 * @brief   Get background layer alpha mode.
 * @details Gets the alpha mode of the background layer.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 *
 * @return              alpha mode
 *
 * @api
 */
dma2d_amode_t dma2dBgGetAlphaMode(DMA2DDriver *dma2dp) {

  dma2d_amode_t mode;
  chSysLock();
  mode = dma2dBgGetAlphaModeI(dma2dp);
  chSysUnlock();
  return mode;
}

/**
 * @brief   Set background layer alpha mode.
 * @details Sets the alpha mode of the background layer.
 * @pre     DMA2D is ready.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 * @param[in] mode      alpha mode
 *
 * @iclass
 */
void dma2dBgSetAlphaModeI(DMA2DDriver *dma2dp, dma2d_amode_t mode) {

  osalDbgCheckClassI();
  osalDbgCheck(dma2dp == &DMA2DD1);
  osalDbgAssert(dma2dp->state == DMA2D_READY, "not ready");
  osalDbgAssert((mode & ~DMA2D_BGPFCCR_AM) == 0, "bounds");
  osalDbgAssert((mode & DMA2D_BGPFCCR_AM) != DMA2D_BGPFCCR_AM, "bounds");
  (void)dma2dp;

