iNavFlight/inav/lib/main/ChibiOS/community/os/hal/ports/STM32/LLD/DMA2Dv1/hal_stm32_dma2d.c
  DMA2D->BGPFCCR = ((DMA2D->BGPFCCR & ~DMA2D_BGPFCCR_AM) |
                    ((uint32_t)mode & DMA2D_BGPFCCR_AM));
}

/**
 * @brief   Set background layer alpha mode.
 * @details Sets the alpha mode of the background layer.
 * @pre     DMA2D is ready.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 * @param[in] mode      alpha mode
 *
 * @api
 */
void dma2dBgSetAlphaMode(DMA2DDriver *dma2dp, dma2d_amode_t mode) {

  chSysLock();
  dma2dBgSetAlphaModeI(dma2dp, mode);
  chSysUnlock();
}

/**
 * @brief   Get background layer pixel format.
 * @details Gets the pixel format of the background layer.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 *
 * @return              pixel format
 *
 * @iclass
 */
dma2d_pixfmt_t dma2dBgGetPixelFormatI(DMA2DDriver *dma2dp) {

  osalDbgCheckClassI();
  osalDbgCheck(dma2dp == &DMA2DD1);
  (void)dma2dp;

  return (dma2d_pixfmt_t)(DMA2D->BGPFCCR & DMA2D_BGPFCCR_CM);
}

/**
 * @brief   Get background layer pixel format.
 * @details Gets the pixel format of the background layer.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 *
 * @return              pixel format
 *
 * @api
 */
dma2d_pixfmt_t dma2dBgGetPixelFormat(DMA2DDriver *dma2dp) {

  dma2d_pixfmt_t fmt;
  chSysLock();
  fmt = dma2dBgGetPixelFormatI(dma2dp);
  chSysUnlock();
  return fmt;
}

/**
 * @brief   Set background layer pixel format.
 * @details Sets the pixel format of the background layer.
 * @pre     DMA2D is ready.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 * @param[in] fmt       pixel format
 *
 * @iclass
 */
void dma2dBgSetPixelFormatI(DMA2DDriver *dma2dp, dma2d_pixfmt_t fmt) {

  osalDbgCheckClassI();
  osalDbgCheck(dma2dp == &DMA2DD1);
  osalDbgAssert(dma2dp->state == DMA2D_READY, "not ready");
  osalDbgAssert(fmt <= DMA2D_MAX_PIXFMT_ID, "bounds");
  (void)dma2dp;

  DMA2D->BGPFCCR = ((DMA2D->BGPFCCR & ~DMA2D_BGPFCCR_CM) |
                    ((uint32_t)fmt & DMA2D_BGPFCCR_CM));
}

/**
 * @brief   Set background layer pixel format.
 * @details Sets the pixel format of the background layer.
 * @pre     DMA2D is ready.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 * @param[in] fmt       pixel format
 *
 * @api
 */
void dma2dBgSetPixelFormat(DMA2DDriver *dma2dp, dma2d_pixfmt_t fmt) {

  chSysLock();
  dma2dBgSetPixelFormatI(dma2dp, fmt);
  chSysUnlock();
}

/**
 * @brief   Get background layer default color.
 * @details Gets the default color of the background layer.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 *
 * @return              default color, RGB-888
 *
 * @iclass
 */
dma2d_color_t dma2dBgGetDefaultColorI(DMA2DDriver *dma2dp) {

  osalDbgCheckClassI();
  osalDbgCheck(dma2dp == &DMA2DD1);
  (void)dma2dp;

  return (dma2d_color_t)(DMA2D->BGCOLR & 0x00FFFFFF);
}

/**
 * @brief   Get background layer default color.
 * @details Gets the default color of the background layer.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 *
 * @return              default color, RGB-888
 *
 * @api
 */
dma2d_color_t dma2dBgGetDefaultColor(DMA2DDriver *dma2dp) {

  dma2d_color_t c;
  chSysLock();
  c = dma2dBgGetDefaultColorI(dma2dp);
  chSysUnlock();
  return c;
}

/**
 * @brief   Set background layer default color.
 * @details Sets the default color of the background layer.
 * @pre     DMA2D is ready.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 * @param[in] c         default color, RGB-888
 *
 * @iclass
 */
void dma2dBgSetDefaultColorI(DMA2DDriver *dma2dp, dma2d_color_t c) {

  osalDbgCheckClassI();
  osalDbgCheck(dma2dp == &DMA2DD1);
  osalDbgAssert(dma2dp->state == DMA2D_READY, "not ready");
  (void)dma2dp;

  DMA2D->BGCOLR = (uint32_t)c & 0x00FFFFFF;
}

/**
 * @brief   Set background layer default color.
 * @details Sets the default color of the background layer.
 * @pre     DMA2D is ready.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 * @param[in] c         default color, RGB-888
 *
 * @api
 */
void dma2dBgSetDefaultColor(DMA2DDriver *dma2dp, dma2d_color_t c) {

  chSysLock();
  dma2dBgSetDefaultColorI(dma2dp, c);
  chSysUnlock();
}

/**
 * @brief   Get background layer palette specifications.
 * @details Gets the palette specifications of the background layer.
 * @note    The palette colors pointer is actually addressed to a @p volatile
 *          memory zone.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 * @param[out] palettep pointer to the palette specifications
 *
 * @iclass
 */
void dma2dBgGetPaletteI(DMA2DDriver *dma2dp, dma2d_palcfg_t *palettep) {

  uint32_t r;

  osalDbgCheckClassI();
  osalDbgCheck(dma2dp == &DMA2DD1);
  osalDbgCheck(palettep != NULL);
  (void)dma2dp;

  r = DMA2D->BGPFCCR;
  palettep->colorsp = (const void *)DMA2D->BGCLUT;
  palettep->length = (uint16_t)((r & DMA2D_BGPFCCR_CS) >> 8) + 1;
  palettep->fmt = (dma2d_pixfmt_t)((r & DMA2D_BGPFCCR_CCM) >> 4);
}

/**
 * @brief   Get background layer palette specifications.
 * @details Gets the palette specifications of the background layer.
 * @note    The palette colors pointer is actually addressed to a @p volatile
 *          memory zone.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 * @param[out] palettep pointer to the palette specifications
 *
 * @api
 */
void dma2dBgGetPalette(DMA2DDriver *dma2dp, dma2d_palcfg_t *palettep) {

  chSysLock();
  dma2dBgGetPaletteI(dma2dp, palettep);
  chSysUnlock();
}

/**
 * @brief   Set background layer palette specifications.
 * @details Sets the palette specifications of the background layer.
 * @note    This function should not be called while the DMA2D is already
 *          executing a job, otherwise the appropriate error interrupt might be
 *          invoked.
 * @pre     DMA2D is ready.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 * @param[in] palettep  pointer to the palette specifications
 *
 * @sclass
 */
void dma2dBgSetPaletteS(DMA2DDriver *dma2dp, const dma2d_palcfg_t *palettep) {

  osalDbgCheckClassS();
  osalDbgCheck(dma2dp == &DMA2DD1);
  osalDbgAssert(dma2dp->state == DMA2D_READY, "not ready");
  osalDbgCheck(palettep != NULL);
  osalDbgCheck(palettep->colorsp != NULL);
  osalDbgAssert(palettep->length > 0, "bounds");
  osalDbgAssert(palettep->length <= DMA2D_MAX_PALETTE_LENGTH, "bounds");
  osalDbgAssert(((palettep->fmt == DMA2D_FMT_ARGB8888) ||
                 (palettep->fmt == DMA2D_FMT_RGB888)), "invalid format");

  DMA2D->BGCMAR = (uint32_t)palettep->colorsp;
  DMA2D->BGPFCCR = (
    (DMA2D->BGPFCCR & ~(DMA2D_BGPFCCR_CS | DMA2D_BGPFCCR_CCM)) |
    ((((uint32_t)palettep->length - 1) << 8) & DMA2D_BGPFCCR_CS) |
    ((uint32_t)palettep->fmt << 4)
  );

  dma2dp->state = DMA2D_ACTIVE;
  DMA2D->BGPFCCR |= DMA2D_BGPFCCR_START;

#if DMA2D_USE_WAIT
  dma2dp->thread = chThdGetSelfX();
  chSchGoSleepS(CH_STATE_SUSPENDED);
#else
  while (DMA2D->BGPFCCR & DMA2D_BGPFCCR_START)
    chSchDoYieldS();
#endif  /* DMA2D_USE_WAIT */
}

/**
 * @brief   Set background layer palette specifications.
 * @details Sets the palette specifications of the background layer.
 * @note    This function should not be called while the DMA2D is already
 *          executing a job, otherwise the appropriate error interrupt might be
 *          invoked.
 * @pre     DMA2D is ready.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 * @param[in] palettep  pointer to the palette specifications
 *
 * @api
 */
void dma2dBgSetPalette(DMA2DDriver *dma2dp, const dma2d_palcfg_t *palettep) {

  chSysLock();
  dma2dBgSetPaletteS(dma2dp, palettep);
  chSysUnlock();
}

/**
 * @brief   Get background layer specifications.
 * @details Gets the background layer specifications at once.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 * @param[out] cfgp     pointer to the layer specifications
 *
 * @iclass
 */
void dma2dBgGetLayerI(DMA2DDriver *dma2dp, dma2d_laycfg_t *cfgp) {

  osalDbgCheckClassI();
  osalDbgCheck(dma2dp == &DMA2DD1);
  osalDbgCheck(cfgp != NULL);

  cfgp->bufferp = dma2dBgGetAddressI(dma2dp);
  cfgp->wrap_offset = dma2dBgGetWrapOffsetI(dma2dp);
  cfgp->fmt = dma2dBgGetPixelFormatI(dma2dp);
  cfgp->def_color = dma2dBgGetDefaultColorI(dma2dp);
  cfgp->const_alpha = dma2dBgGetConstantAlphaI(dma2dp);
  if (cfgp->palettep != NULL)
    dma2dBgGetPaletteI(dma2dp, (dma2d_palcfg_t *)cfgp->palettep);
}

/**
 * @brief   Get background layer specifications.
 * @details Gets the background layer specifications at once.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 * @param[out] cfgp     pointer to the layer specifications
 *
 * @api
 */
void dma2dBgGetLayer(DMA2DDriver *dma2dp, dma2d_laycfg_t *cfgp) {

  chSysLock();
  dma2dBgGetLayerI(dma2dp, cfgp);
  chSysUnlock();
}

/**
 * @brief   Set background layer specifications.
 * @details Sets the background layer specifications at once.
 * @note    If the palette is unspecified, the layer palette is unmodified.
 * @note    This function should not be called while the DMA2D is already
 *          executing a job, otherwise the appropriate error interrupt might be
 *          invoked.
 * @pre     DMA2D is ready.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 * @param[in] cfgp      pointer to the layer specifications
 *
 * @sclass
 */
void dma2dBgSetConfigS(DMA2DDriver *dma2dp, const dma2d_laycfg_t *cfgp) {

  osalDbgCheckClassS();
  osalDbgCheck(dma2dp == &DMA2DD1);
  osalDbgAssert(dma2dp->state == DMA2D_READY, "not ready");
  osalDbgCheck(cfgp != NULL);

  dma2dBgSetAddressI(dma2dp, cfgp->bufferp);
  dma2dBgSetWrapOffsetI(dma2dp, cfgp->wrap_offset);
  dma2dBgSetPixelFormatI(dma2dp, cfgp->fmt);
  dma2dBgSetDefaultColorI(dma2dp, cfgp->def_color);
  dma2dBgSetConstantAlphaI(dma2dp, cfgp->const_alpha);
  if (cfgp->palettep != NULL)
    dma2dBgSetPaletteS(dma2dp, cfgp->palettep);
}

/**
 * @brief   Set background layer specifications.
 * @details Sets the background layer specifications at once.
 * @note    If the palette is unspecified, the layer palette is unmodified.
 * @note    This function should not be called while the DMA2D is already
 *          executing a job, otherwise the appropriate error interrupt might be
 *          invoked.
 * @pre     DMA2D is ready.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 * @param[in] cfgp      pointer to the layer specifications
 *
 * @api
 */
void dma2dBgSetConfig(DMA2DDriver *dma2dp, const dma2d_laycfg_t *cfgp) {

  chSysLock();
  dma2dBgSetConfigS(dma2dp, cfgp);
  chSysUnlock();
}

/** @} */

/**
 * @name    DMA2D foreground layer methods
 * @{
 */

/**
 * @brief   Get foreground layer buffer address.
 * @details Gets the buffer address of the foreground layer.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 *
 * @return              buffer address
 *
 * @iclass
 */
void *dma2dFgGetAddressI(DMA2DDriver *dma2dp) {

  osalDbgCheckClassI();
  osalDbgCheck(dma2dp == &DMA2DD1);
  (void)dma2dp;

  return (void *)DMA2D->FGMAR;
}

/**
 * @brief   Get foreground layer buffer address.
 * @details Gets the buffer address of the foreground layer.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 *
 * @return              buffer address
 *
 * @api
 */
void *dma2dFgGetAddress(DMA2DDriver *dma2dp) {

