iNavFlight/inav/lib/main/ChibiOS/community/os/hal/ports/STM32/LLD/DMA2Dv1/hal_stm32_dma2d.c
  void *bufferp;
  chSysLock();
  bufferp = dma2dFgGetAddressI(dma2dp);
  chSysUnlock();
  return bufferp;
}

/**
 * @brief   Set foreground layer buffer address.
 * @details Sets the buffer address of the foreground layer.
 * @pre     DMA2D is ready.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 * @param[in] bufferp   buffer address
 *
 * @iclass
 */
void dma2dFgSetAddressI(DMA2DDriver *dma2dp, void *bufferp) {

  osalDbgCheckClassI();
  osalDbgCheck(dma2dp == &DMA2DD1);
  osalDbgAssert(dma2dp->state == DMA2D_READY, "not ready");
  osalDbgCheck(dma2dIsAligned(bufferp, dma2dFgGetPixelFormatI(dma2dp)));
  (void)dma2dp;

  DMA2D->FGMAR = (uint32_t)bufferp;
}

/**
 * @brief   Set foreground layer buffer address.
 * @details Sets the buffer address of the foreground layer.
 * @pre     DMA2D is ready.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 * @param[in] bufferp   buffer address
 *
 * @api
 */
void dma2dFgSetAddress(DMA2DDriver *dma2dp, void *bufferp) {

  chSysLock();
  dma2dFgSetAddressI(dma2dp, bufferp);
  chSysUnlock();
}

/**
 * @brief   Get foreground layer wrap offset.
 * @details Gets the buffer line wrap offset of the foreground layer.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 *
 * @return              wrap offset, in pixels
 *
 * @iclass
 */
size_t dma2dFgGetWrapOffsetI(DMA2DDriver *dma2dp) {

  osalDbgCheckClassI();
  osalDbgCheck(dma2dp == &DMA2DD1);
  (void)dma2dp;

  return (size_t)(DMA2D->FGOR & DMA2D_FGOR_LO);
}

/**
 * @brief   Get foreground layer wrap offset.
 * @details Gets the buffer line wrap offset of the foreground layer.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 *
 * @return              wrap offset, in pixels
 *
 * @api
 */
size_t dma2dFgGetWrapOffset(DMA2DDriver *dma2dp) {

  size_t offset;
  chSysLock();
  offset = dma2dFgGetWrapOffsetI(dma2dp);
  chSysUnlock();
  return offset;
}

/**
 * @brief   Set foreground layer wrap offset.
 * @details Sets the buffer line wrap offset of the foreground layer.
 * @pre     DMA2D is ready.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 * @param[in] offset    wrap offset, in pixels
 *
 * @iclass
 */
void dma2dFgSetWrapOffsetI(DMA2DDriver *dma2dp, size_t offset) {

  osalDbgCheckClassI();
  osalDbgCheck(dma2dp == &DMA2DD1);
  osalDbgAssert(dma2dp->state == DMA2D_READY, "not ready");
  osalDbgAssert(offset <= DMA2D_MAX_OFFSET, "bounds");
  (void)dma2dp;

  DMA2D->FGOR = ((DMA2D->FGOR & ~DMA2D_FGOR_LO) |
                 ((uint32_t)offset & DMA2D_FGOR_LO));
}

/**
 * @brief   Set foreground layer wrap offset.
 * @details Sets the buffer line wrap offset of the foreground layer.
 * @pre     DMA2D is ready.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 * @param[in] offset    wrap offset, in pixels
 *
 * @api
 */
void dma2dFgSetWrapOffset(DMA2DDriver *dma2dp, size_t offset) {

  chSysLock();
  dma2dFgSetWrapOffsetI(dma2dp, offset);
  chSysUnlock();
}

/**
 * @brief   Get foreground layer constant alpha.
 * @details Gets the constant alpha component of the foreground layer.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 *
 * @return              constant alpha component, A-8
 *
 * @iclass
 */
uint8_t dma2dFgGetConstantAlphaI(DMA2DDriver *dma2dp) {

  osalDbgCheckClassI();
  osalDbgCheck(dma2dp == &DMA2DD1);
  (void)dma2dp;

  return (uint8_t)((DMA2D->FGPFCCR & DMA2D_FGPFCCR_ALPHA) >> 24);
}

/**
 * @brief   Get foreground layer constant alpha.
 * @details Gets the constant alpha component of the foreground layer.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 *
 * @return              constant alpha component, A-8
 *
 * @api
 */
uint8_t dma2dFgGetConstantAlpha(DMA2DDriver *dma2dp) {

  uint8_t a;
  chSysLock();
  a = dma2dFgGetConstantAlphaI(dma2dp);
  chSysUnlock();
  return a;
}

/**
 * @brief   Set foreground layer constant alpha.
 * @details Sets the constant alpha component of the foreground layer.
 * @pre     DMA2D is ready.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 * @param[in] a         constant alpha component, A-8
 *
 * @iclass
 */
void dma2dFgSetConstantAlphaI(DMA2DDriver *dma2dp, uint8_t a) {

  osalDbgCheckClassI();
  osalDbgCheck(dma2dp == &DMA2DD1);
  osalDbgAssert(dma2dp->state == DMA2D_READY, "not ready");
  (void)dma2dp;

  DMA2D->FGPFCCR = ((DMA2D->FGPFCCR & ~DMA2D_FGPFCCR_ALPHA) |
                    (((uint32_t)a << 24) & DMA2D_FGPFCCR_ALPHA));
}

/**
 * @brief   Set foreground layer constant alpha.
 * @details Sets the constant alpha component of the foreground layer.
 * @pre     DMA2D is ready.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 * @param[in] a         constant alpha component, A-8
 *
 * @api
 */
void dma2dFgSetConstantAlpha(DMA2DDriver *dma2dp, uint8_t a) {

  chSysLock();
  dma2dFgSetConstantAlphaI(dma2dp, a);
  chSysUnlock();
}

/**
 * @brief   Get foreground layer alpha mode.
 * @details Gets the alpha mode of the foreground layer.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 *
 * @return              alpha mode
 *
 * @iclass
 */
dma2d_amode_t dma2dFgGetAlphaModeI(DMA2DDriver *dma2dp) {

  osalDbgCheckClassI();
  osalDbgCheck(dma2dp == &DMA2DD1);
  (void)dma2dp;

  return (dma2d_amode_t)(DMA2D->FGPFCCR & DMA2D_FGPFCCR_AM);
}

/**
 * @brief   Get foreground layer alpha mode.
 * @details Gets the alpha mode of the foreground layer.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 *
 * @return              alpha mode
 *
 * @api
 */
dma2d_amode_t dma2dFgGetAlphaMode(DMA2DDriver *dma2dp) {

  dma2d_amode_t mode;
  chSysLock();
  mode = dma2dFgGetAlphaModeI(dma2dp);
  chSysUnlock();
  return mode;
}

/**
 * @brief   Set foreground layer alpha mode.
 * @details Sets the alpha mode of the foreground layer.
 * @pre     DMA2D is ready.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 * @param[in] mode      alpha mode
 *
 * @iclass
 */
void dma2dFgSetAlphaModeI(DMA2DDriver *dma2dp, dma2d_amode_t mode) {

  osalDbgCheckClassI();
  osalDbgCheck(dma2dp == &DMA2DD1);
  osalDbgAssert(dma2dp->state == DMA2D_READY, "not ready");
  osalDbgAssert((mode & ~DMA2D_FGPFCCR_AM) == 0, "bounds");
  osalDbgAssert((mode & DMA2D_FGPFCCR_AM) != DMA2D_FGPFCCR_AM, "bounds");
  (void)dma2dp;

  DMA2D->FGPFCCR = ((DMA2D->FGPFCCR & ~DMA2D_FGPFCCR_AM) |
                    ((uint32_t)mode & DMA2D_FGPFCCR_AM));
}

/**
 * @brief   Set foreground layer alpha mode.
 * @details Sets the alpha mode of the foreground layer.
 * @pre     DMA2D is ready.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 * @param[in] mode      alpha mode
 *
 * @api
 */
void dma2dFgSetAlphaMode(DMA2DDriver *dma2dp, dma2d_amode_t mode) {

  chSysLock();
  dma2dFgSetAlphaModeI(dma2dp, mode);
  chSysUnlock();
}

/**
 * @brief   Get foreground layer pixel format.
 * @details Gets the pixel format of the foreground layer.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 *
 * @return              pixel format
 *
 * @iclass
 */
dma2d_pixfmt_t dma2dFgGetPixelFormatI(DMA2DDriver *dma2dp) {

  osalDbgCheckClassI();
  osalDbgCheck(dma2dp == &DMA2DD1);
  (void)dma2dp;

  return (dma2d_pixfmt_t)(DMA2D->FGPFCCR & DMA2D_FGPFCCR_CM);
}

/**
 * @brief   Get foreground layer pixel format.
 * @details Gets the pixel format of the foreground layer.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 *
 * @return              pixel format
 *
 * @api
 */
dma2d_pixfmt_t dma2dFgGetPixelFormat(DMA2DDriver *dma2dp) {

  dma2d_pixfmt_t fmt;
  chSysLock();
  fmt = dma2dFgGetPixelFormatI(dma2dp);
  chSysUnlock();
  return fmt;
}

/**
 * @brief   Set foreground layer pixel format.
 * @details Sets the pixel format of the foreground layer.
 * @pre     DMA2D is ready.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 * @param[in] fmt       pixel format
 *
 * @iclass
 */
void dma2dFgSetPixelFormatI(DMA2DDriver *dma2dp, dma2d_pixfmt_t fmt) {

  osalDbgCheckClassI();
  osalDbgCheck(dma2dp == &DMA2DD1);
  osalDbgAssert(dma2dp->state == DMA2D_READY, "not ready");
  osalDbgAssert(fmt <= DMA2D_MAX_PIXFMT_ID, "bounds");
  (void)dma2dp;

  DMA2D->FGPFCCR = ((DMA2D->FGPFCCR & ~DMA2D_FGPFCCR_CM) |
                    ((uint32_t)fmt & DMA2D_FGPFCCR_CM));
}

/**
 * @brief   Set foreground layer pixel format.
 * @details Sets the pixel format of the foreground layer.
 * @pre     DMA2D is ready.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 * @param[in] fmt       pixel format
 *
 * @api
 */
void dma2dFgSetPixelFormat(DMA2DDriver *dma2dp, dma2d_pixfmt_t fmt) {

  chSysLock();
  dma2dFgSetPixelFormatI(dma2dp, fmt);
  chSysUnlock();
}

/**
 * @brief   Get foreground layer default color.
 * @details Gets the default color of the foreground layer.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 *
 * @return              default color, RGB-888
 *
 * @iclass
 */
dma2d_color_t dma2dFgGetDefaultColorI(DMA2DDriver *dma2dp) {

  osalDbgCheckClassI();
  osalDbgCheck(dma2dp == &DMA2DD1);
  (void)dma2dp;

  return (dma2d_color_t)(DMA2D->FGCOLR & 0x00FFFFFF);
}

/**
 * @brief   Get foreground layer default color.
 * @details Gets the default color of the foreground layer.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 *
 * @return              default color, RGB-888
 *
 * @api
 */
dma2d_color_t dma2dFgGetDefaultColor(DMA2DDriver *dma2dp) {

  dma2d_color_t c;
  chSysLock();
  c = dma2dFgGetDefaultColorI(dma2dp);
  chSysUnlock();
  return c;
}

/**
 * @brief   Set foreground layer default color.
 * @details Sets the default color of the foreground layer.
 * @pre     DMA2D is ready.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 * @param[in] c         default color, RGB-888
 *
 * @iclass
 */
void dma2dFgSetDefaultColorI(DMA2DDriver *dma2dp, dma2d_color_t c) {

  osalDbgCheckClassI();
  osalDbgCheck(dma2dp == &DMA2DD1);
  osalDbgAssert(dma2dp->state == DMA2D_READY, "not ready");
  (void)dma2dp;

  DMA2D->FGCOLR = (uint32_t)c & 0x00FFFFFF;
}

/**
 * @brief   Set foreground layer default color.
 * @details Sets the default color of the foreground layer.
 * @pre     DMA2D is ready.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 * @param[in] c         default color, RGB-888
 *
 * @api
 */
void dma2dFgSetDefaultColor(DMA2DDriver *dma2dp, dma2d_color_t c) {

  chSysLock();
  dma2dFgSetDefaultColorI(dma2dp, c);
  chSysUnlock();
}

/**
 * @brief   Get foreground layer palette specifications.
 * @details Gets the palette specifications of the foreground layer.
 * @note    The palette colors pointer is actually addressed to a @p volatile
 *          memory zone.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 * @param[out] palettep pointer to the palette specifications
 *
 * @iclass
 */
void dma2dFgGetPaletteI(DMA2DDriver *dma2dp, dma2d_palcfg_t *palettep) {

  uint32_t r;

  osalDbgCheckClassI();
  osalDbgCheck(dma2dp == &DMA2DD1);
  osalDbgCheck(palettep != NULL);
  (void)dma2dp;

  r = DMA2D->FGPFCCR;
  palettep->colorsp = (const void *)DMA2D->FGCLUT;
  palettep->length = (uint16_t)((r & DMA2D_FGPFCCR_CS) >> 8) + 1;
  palettep->fmt = (dma2d_pixfmt_t)((r & DMA2D_FGPFCCR_CCM) >> 4);
}

/**
 * @brief   Get foreground layer palette specifications.
 * @details Gets the palette specifications of the foreground layer.
 * @note    The palette colors pointer is actually addressed to a @p volatile
 *          memory zone.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 * @param[out] palettep pointer to the palette specifications
 *
 * @api
 */
void dma2dFgGetPalette(DMA2DDriver *dma2dp, dma2d_palcfg_t *palettep) {

  chSysLock();
  dma2dFgGetPaletteI(dma2dp, palettep);
  chSysUnlock();
}

/**
 * @brief   Set foreground layer palette specifications.
 * @details Sets the palette specifications of the foreground layer.
 * @note    This function should not be called while the DMA2D is already
 *          executing a job, otherwise the appropriate error interrupt might be
 *          invoked.
 * @pre     DMA2D is ready.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 * @param[in] palettep  pointer to the palette specifications
 *
 * @sclass
 */
void dma2dFgSetPaletteS(DMA2DDriver *dma2dp, const dma2d_palcfg_t *palettep) {

  osalDbgCheckClassS();
  osalDbgCheck(dma2dp == &DMA2DD1);
  osalDbgAssert(dma2dp->state == DMA2D_READY, "not ready");
  osalDbgCheck(palettep != NULL);
  osalDbgCheck(palettep->colorsp != NULL);
  osalDbgAssert(palettep->length > 0, "bounds");
  osalDbgAssert(palettep->length <= DMA2D_MAX_PALETTE_LENGTH, "bounds");
  osalDbgAssert(((palettep->fmt == DMA2D_FMT_ARGB8888) ||
                 (palettep->fmt == DMA2D_FMT_RGB888)), "invalid format");

  DMA2D->FGCMAR = (uint32_t)palettep->colorsp;
  DMA2D->FGPFCCR = (
    (DMA2D->FGPFCCR & ~(DMA2D_FGPFCCR_CS | DMA2D_FGPFCCR_CCM)) |
    ((((uint32_t)palettep->length - 1) << 8) & DMA2D_FGPFCCR_CS) |
    ((uint32_t)palettep->fmt << 4)
  );

  dma2dp->state = DMA2D_ACTIVE;
  DMA2D->FGPFCCR |= DMA2D_FGPFCCR_START;

#if DMA2D_USE_WAIT
  dma2dp->thread = chThdGetSelfX();
  chSchGoSleepS(CH_STATE_SUSPENDED);
#else
  while (DMA2D->FGPFCCR & DMA2D_FGPFCCR_START)
    chSchDoYieldS();
#endif  /* DMA2D_USE_WAIT */
}

/**
 * @brief   Set foreground layer palette specifications.
 * @details Sets the palette specifications of the foreground layer.
 * @note    This function should not be called while the DMA2D is already
 *          executing a job, otherwise the appropriate error interrupt might be
 *          invoked.
 * @pre     DMA2D is ready.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 * @param[in] palettep  pointer to the palette specifications
 *
 * @api
 */
void dma2dFgSetPalette(DMA2DDriver *dma2dp, const dma2d_palcfg_t *palettep) {

  chSysLock();
  dma2dFgSetPaletteS(dma2dp, palettep);
  chSysUnlock();
}

/**
 * @brief   Get foreground layer specifications.
 * @details Gets the foreground layer specifications at once.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 * @param[out] cfgp     pointer to the layer specifications
 *
 * @iclass
 */
void dma2dFgGetLayerI(DMA2DDriver *dma2dp, dma2d_laycfg_t *cfgp) {

  osalDbgCheckClassI();
  osalDbgCheck(dma2dp == &DMA2DD1);
  osalDbgCheck(cfgp != NULL);

  cfgp->bufferp = dma2dFgGetAddressI(dma2dp);
  cfgp->wrap_offset = dma2dFgGetWrapOffsetI(dma2dp);
  cfgp->fmt = dma2dFgGetPixelFormatI(dma2dp);
  cfgp->def_color = dma2dFgGetDefaultColorI(dma2dp);
  cfgp->const_alpha = dma2dFgGetConstantAlphaI(dma2dp);
  if (cfgp->palettep != NULL)
    dma2dFgGetPaletteI(dma2dp, (dma2d_palcfg_t *)cfgp->palettep);
}

/**
 * @brief   Get foreground layer specifications.
 * @details Gets the foreground layer specifications at once.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 * @param[out] cfgp     pointer to the layer specifications
 *
 * @api
 */
void dma2dFgGetLayer(DMA2DDriver *dma2dp, dma2d_laycfg_t *cfgp) {

  chSysLock();
  dma2dFgGetLayerI(dma2dp, cfgp);
  chSysUnlock();
}

/**
 * @brief   Set foreground layer specifications.
 * @details Sets the foreground layer specifications at once.
 * @note    If the palette is unspecified, the layer palette is unmodified.
 * @note    This function should not be called while the DMA2D is already
 *          executing a job, otherwise the appropriate error interrupt might be
 *          invoked.
 * @pre     DMA2D is ready.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 * @param[in] cfgp      pointer to the layer specifications
 *
 * @sclass
 */
void dma2dFgSetConfigS(DMA2DDriver *dma2dp, const dma2d_laycfg_t *cfgp) {

  osalDbgCheckClassS();
  osalDbgCheck(dma2dp == &DMA2DD1);
  osalDbgAssert(dma2dp->state == DMA2D_READY, "not ready");
  osalDbgCheck(cfgp != NULL);

  dma2dFgSetAddressI(dma2dp, cfgp->bufferp);
  dma2dFgSetWrapOffsetI(dma2dp, cfgp->wrap_offset);
  dma2dFgSetPixelFormatI(dma2dp, cfgp->fmt);
  dma2dFgSetDefaultColorI(dma2dp, cfgp->def_color);
  dma2dFgSetConstantAlphaI(dma2dp, cfgp->const_alpha);
  if (cfgp->palettep != NULL)
    dma2dFgSetPaletteS(dma2dp, cfgp->palettep);
}

/**
 * @brief   Set foreground layer specifications.
 * @details Sets the foreground layer specifications at once.
 * @note    If the palette is unspecified, the layer palette is unmodified.
 * @note    This function should not be called while the DMA2D is already
 *          executing a job, otherwise the appropriate error interrupt might be
 *          invoked.
 * @pre     DMA2D is ready.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 * @param[in] cfgp      pointer to the layer specifications
 *
 * @api
 */
void dma2dFgSetConfig(DMA2DDriver *dma2dp, const dma2d_laycfg_t *cfgp) {

  chSysLock();
  dma2dFgSetConfigS(dma2dp, cfgp);
  chSysUnlock();
}

/** @} */

/**
 * @name    DMA2D output layer methods
 * @{
 */

/**
 * @brief   Get output layer buffer address.
 * @details Gets the buffer address of the output layer.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 *
 * @return              buffer address
 *
 * @iclass
 */
void *dma2dOutGetAddressI(DMA2DDriver *dma2dp) {

  osalDbgCheckClassI();
  osalDbgCheck(dma2dp == &DMA2DD1);
  (void)dma2dp;

  return (void *)DMA2D->OMAR;
}

/**
 * @brief   Get output layer buffer address.
 * @details Gets the buffer address of the output layer.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 *
 * @return              buffer address
 *
 * @api
 */
void *dma2dOutGetAddress(DMA2DDriver *dma2dp) {

