iNavFlight/inav/lib/main/ChibiOS/community/os/hal/ports/STM32/LLD/DMA2Dv1/hal_stm32_dma2d.c
  void *bufferp;
  chSysLock();
  bufferp = dma2dOutGetAddressI(dma2dp);
  chSysUnlock();
  return bufferp;
}

/**
 * @brief   Set output layer buffer address.
 * @details Sets the buffer address of the output layer.
 * @pre     DMA2D is ready.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 * @param[in] bufferp   buffer address
 *
 * @iclass
 */
void dma2dOutSetAddressI(DMA2DDriver *dma2dp, void *bufferp) {

  osalDbgCheckClassI();
  osalDbgCheck(dma2dp == &DMA2DD1);
  osalDbgAssert(dma2dp->state == DMA2D_READY, "not ready");
  osalDbgCheck(dma2dIsAligned(bufferp, dma2dOutGetPixelFormatI(dma2dp)));
  (void)dma2dp;

  DMA2D->OMAR = (uint32_t)bufferp;
}

/**
 * @brief   Set output layer buffer address.
 * @details Sets the buffer address of the output layer.
 * @pre     DMA2D is ready.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 * @param[in] bufferp   buffer address
 *
 * @api
 */
void dma2dOutSetAddress(DMA2DDriver *dma2dp, void *bufferp) {

  chSysLock();
  dma2dOutSetAddressI(dma2dp, bufferp);
  chSysUnlock();
}

/**
 * @brief   Get output layer wrap offset.
 * @details Gets the buffer line wrap offset of the output layer.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 *
 * @return              wrap offset, in pixels
 *
 * @iclass
 */
size_t dma2dOutGetWrapOffsetI(DMA2DDriver *dma2dp) {

  osalDbgCheckClassI();
  osalDbgCheck(dma2dp == &DMA2DD1);
  (void)dma2dp;

  return (size_t)(DMA2D->OOR & DMA2D_OOR_LO);
}

/**
 * @brief   Get output layer wrap offset.
 * @details Gets the buffer line wrap offset of the output layer.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 *
 * @return              wrap offset, in pixels
 *
 * @api
 */
size_t dma2dOutGetWrapOffset(DMA2DDriver *dma2dp) {

  size_t offset;
  chSysLock();
  offset = dma2dOutGetWrapOffsetI(dma2dp);
  chSysUnlock();
  return offset;
}

/**
 * @brief   Set output layer wrap offset.
 * @details Sets the buffer line wrap offset of the output layer.
 * @pre     DMA2D is ready.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 * @param[in] offset    wrap offset, in pixels
 *
 * @iclass
 */
void dma2dOutSetWrapOffsetI(DMA2DDriver *dma2dp, size_t offset) {

  osalDbgCheckClassI();
  osalDbgCheck(dma2dp == &DMA2DD1);
  osalDbgAssert(dma2dp->state == DMA2D_READY, "not ready");
  osalDbgAssert(offset <= DMA2D_MAX_OFFSET, "bounds");
  (void)dma2dp;

  DMA2D->OOR = ((DMA2D->OOR & ~DMA2D_OOR_LO) |
                ((uint32_t)offset & DMA2D_OOR_LO));
}

/**
 * @brief   Set output layer wrap offset.
 * @details Sets the buffer line wrap offset of the output layer.
 * @pre     DMA2D is ready.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 * @param[in] offset    wrap offset, in pixels
 *
 * @api
 */
void dma2dOutSetWrapOffset(DMA2DDriver *dma2dp, size_t offset) {

  chSysLock();
  dma2dOutSetWrapOffsetI(dma2dp, offset);
  chSysUnlock();
}

/**
 * @brief   Get output layer pixel format.
 * @details Gets the pixel format of the output layer.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 *
 * @return              pixel format
 *
 * @iclass
 */
dma2d_pixfmt_t dma2dOutGetPixelFormatI(DMA2DDriver *dma2dp) {

  osalDbgCheckClassI();
  osalDbgCheck(dma2dp == &DMA2DD1);
  (void)dma2dp;

  return (dma2d_pixfmt_t)(DMA2D->OPFCCR & DMA2D_OPFCCR_CM);
}

/**
 * @brief   Get output layer pixel format.
 * @details Gets the pixel format of the output layer.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 *
 * @return              pixel format
 *
 * @api
 */
dma2d_pixfmt_t dma2dOutGetPixelFormat(DMA2DDriver *dma2dp) {

  dma2d_pixfmt_t fmt;
  chSysLock();
  fmt = dma2dOutGetPixelFormatI(dma2dp);
  chSysUnlock();
  return fmt;
}

/**
 * @brief   Set output layer pixel format.
 * @details Sets the pixel format of the output layer.
 * @pre     DMA2D is ready.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 * @param[in] fmt       pixel format
 *
 * @iclass
 */
void dma2dOutSetPixelFormatI(DMA2DDriver *dma2dp, dma2d_pixfmt_t fmt) {

  osalDbgCheckClassI();
  osalDbgCheck(dma2dp == &DMA2DD1);
  osalDbgAssert(dma2dp->state == DMA2D_READY, "not ready");
  osalDbgAssert(fmt <= DMA2D_MAX_OUTPIXFMT_ID, "bounds");
  (void)dma2dp;

  DMA2D->OPFCCR = ((DMA2D->OPFCCR & ~DMA2D_OPFCCR_CM) |
                   ((uint32_t)fmt & DMA2D_OPFCCR_CM));
}

/**
 * @brief   Set output layer pixel format.
 * @details Sets the pixel format of the output layer.
 * @pre     DMA2D is ready.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 * @param[in] fmt       pixel format
 *
 * @api
 */
void dma2dOutSetPixelFormat(DMA2DDriver *dma2dp, dma2d_pixfmt_t fmt) {

  chSysLock();
  dma2dOutSetPixelFormatI(dma2dp, fmt);
  chSysUnlock();
}

/**
 * @brief   Get output layer default color.
 * @details Gets the default color of the output layer.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 *
 * @return              default color, chosen output format
 *
 * @iclass
 */
dma2d_color_t dma2dOutGetDefaultColorI(DMA2DDriver *dma2dp) {

  osalDbgCheckClassI();
  osalDbgCheck(dma2dp == &DMA2DD1);
  (void)dma2dp;

  return (dma2d_color_t)(DMA2D->OCOLR & 0x00FFFFFF);
}

/**
 * @brief   Get output layer default color.
 * @details Gets the default color of the output layer.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 *
 * @return              default color, chosen output format
 *
 * @api
 */
dma2d_color_t dma2dOutGetDefaultColor(DMA2DDriver *dma2dp) {

  dma2d_color_t c;
  chSysLock();
  c = dma2dOutGetDefaultColorI(dma2dp);
  chSysUnlock();
  return c;
}

/**
 * @brief   Set output layer default color.
 * @details Sets the default color of the output layer.
 * @pre     DMA2D is ready.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 * @param[in] c         default color, chosen output format
 *
 * @iclass
 */
void dma2dOutSetDefaultColorI(DMA2DDriver *dma2dp, dma2d_color_t c) {

  osalDbgCheckClassI();
  osalDbgCheck(dma2dp == &DMA2DD1);
  osalDbgAssert(dma2dp->state == DMA2D_READY, "not ready");
  (void)dma2dp;

  DMA2D->OCOLR = (uint32_t)c & 0x00FFFFFF;
}

/**
 * @brief   Set output layer default color.
 * @details Sets the default color of the output layer.
 * @pre     DMA2D is ready.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 * @param[in] c         default color, chosen output format
 *
 * @api
 */
void dma2dOutSetDefaultColor(DMA2DDriver *dma2dp, dma2d_color_t c) {

  chSysLock();
  dma2dOutSetDefaultColorI(dma2dp, c);
  chSysUnlock();
}

/**
 * @brief   Get output layer specifications.
 * @details Gets the output layer specifications at once.
 * @note    Constant alpha and palette specifications are ignored.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 * @param[out] cfgp     pointer to the layer specifications
 *
 * @iclass
 */
void dma2dOutGetLayerI(DMA2DDriver *dma2dp, dma2d_laycfg_t *cfgp) {

  osalDbgCheckClassI();
  osalDbgCheck(dma2dp == &DMA2DD1);
  osalDbgCheck(cfgp != NULL);

