iNavFlight/inav/lib/main/ChibiOS/community/os/hal/ports/STM32/LLD/DMA2Dv1/hal_stm32_dma2d.c
  cfgp->bufferp = dma2dOutGetAddressI(dma2dp);
  cfgp->wrap_offset = dma2dOutGetWrapOffsetI(dma2dp);
  cfgp->fmt = dma2dOutGetPixelFormatI(dma2dp);
  cfgp->def_color = dma2dOutGetDefaultColorI(dma2dp);
}

/**
 * @brief   Get output layer specifications.
 * @details Gets the output layer specifications at once.
 * @note    Constant alpha and palette specifications are ignored.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 * @param[out] cfgp     pointer to the layer specifications
 *
 * @api
 */
void dma2dOutGetLayer(DMA2DDriver *dma2dp, dma2d_laycfg_t *cfgp) {

  chSysLock();
  dma2dOutGetLayerI(dma2dp, cfgp);
  chSysUnlock();
}

/**
 * @brief   Set output layer specifications.
 * @details Sets the output layer specifications at once.
 * @note    Constant alpha and palette specifications are ignored.
 * @pre     DMA2D is ready.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 * @param[in] cfgp      pointer to the layer specifications
 *
 * @iclass
 */
void dma2dOutSetConfigI(DMA2DDriver *dma2dp, const dma2d_laycfg_t *cfgp) {

  osalDbgCheckClassI();
  osalDbgCheck(dma2dp == &DMA2DD1);
  osalDbgAssert(dma2dp->state == DMA2D_READY, "not ready");
  osalDbgCheck(cfgp != NULL);

  dma2dOutSetAddressI(dma2dp, cfgp->bufferp);
  dma2dOutSetWrapOffsetI(dma2dp, cfgp->wrap_offset);
  dma2dOutSetPixelFormatI(dma2dp, cfgp->fmt);
  dma2dOutSetDefaultColorI(dma2dp, cfgp->def_color);
}

/**
 * @brief   Set output layer specifications.
 * @details Sets the output layer specifications at once.
 * @note    Constant alpha and palette specifications are ignored.
 * @pre     DMA2D is ready.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 * @param[in] cfgp      pointer to the layer specifications
 *
 * @api
 */
void dma2dOutSetConfig(DMA2DDriver *dma2dp, const dma2d_laycfg_t *cfgp) {

  chSysLock();
  dma2dOutSetConfigI(dma2dp, cfgp);
  chSysUnlock();
}

/** @} */

/**
 * @name    DMA2D helper functions
 * @{
 */

/**
 * @brief   Compute pixel address.
 * @details Computes the buffer address of a pixel, given the buffer
 *          specifications.
 *
 * @param[in] originp   buffer origin address
 * @param[in] pitch     buffer pitch, in bytes
 * @param[in] fmt       buffer pixel format
 * @param[in] x         horizontal pixel coordinate
 * @param[in] y         vertical pixel coordinate
 *
 * @return              pixel address, constant data
 *
 * @api
 */
const void *dma2dComputeAddressConst(const void *originp, size_t pitch,
                                     dma2d_pixfmt_t fmt,
                                     uint16_t x, uint16_t y) {

  osalDbgCheck(pitch > 0);

  switch (fmt) {
  case DMA2D_FMT_ARGB8888:
    return (const void *)((uintptr_t)originp +
                          (uintptr_t)y * pitch + (uintptr_t)x * 4);
  case DMA2D_FMT_RGB888:
    return (const void *)((uintptr_t)originp +
                          (uintptr_t)y * pitch + (uintptr_t)x * 3);
  case DMA2D_FMT_RGB565:
  case DMA2D_FMT_ARGB1555:
  case DMA2D_FMT_ARGB4444:
  case DMA2D_FMT_AL88:
    return (const void *)((uintptr_t)originp +
                          (uintptr_t)y * pitch + (uintptr_t)x * 2);
  case DMA2D_FMT_L8:
  case DMA2D_FMT_AL44:
  case DMA2D_FMT_A8:
    return (const void *)((uintptr_t)originp +
                          (uintptr_t)y * pitch + (uintptr_t)x);
  case DMA2D_FMT_L4:
  case DMA2D_FMT_A4:
    osalDbgAssert((x & 1) == 0, "not aligned");
    return (const void *)((uintptr_t)originp +
                          (uintptr_t)y * pitch + (uintptr_t)x / 2);
  default:
    osalDbgAssert(false, "invalid format");
    return NULL;
  }
}

/**
 * @brief   Address is aligned.
 * @details Tells whether the address is aligned with the provided pixel format.
 *
 * @param[in] bufferp   address
 * @param[in] fmt       pixel format
 *
 * @return              address is aligned
 *
 * @api
 */
bool dma2dIsAligned(const void *bufferp, dma2d_pixfmt_t fmt) {

  switch (fmt) {
  case DMA2D_FMT_ARGB8888:
  case DMA2D_FMT_RGB888:
    return ((uintptr_t)bufferp & 3) == 0;   /* 32-bit alignment.*/
  case DMA2D_FMT_RGB565:
  case DMA2D_FMT_ARGB1555:
  case DMA2D_FMT_ARGB4444:
  case DMA2D_FMT_AL88:
    return ((uintptr_t)bufferp & 1) == 0;   /* 16-bit alignment.*/
  case DMA2D_FMT_L8:
  case DMA2D_FMT_AL44:
  case DMA2D_FMT_L4:
  case DMA2D_FMT_A8:
  case DMA2D_FMT_A4:
    return true;                            /* 8-bit alignment.*/
  default:
    osalDbgAssert(false, "invalid format");
    return false;
  }
}

/**
 * @brief   Compute bits per pixel.
 * @details Computes the bits per pixel for the specified pixel format.
 *
 * @param[in] fmt       pixel format
 *
 * @retuen              bits per pixel
 *
 * @api
 */
size_t dma2dBitsPerPixel(dma2d_pixfmt_t fmt) {

  osalDbgAssert(fmt < DMA2D_MAX_PIXFMT_ID, "invalid format");

  return (size_t)dma2d_bpp[(unsigned)fmt];
}

#if DMA2D_USE_SOFTWARE_CONVERSIONS || defined(__DOXYGEN__)

/**
 * @brief   Convert from ARGB-8888.
 * @details Converts an ARGB-8888 color to the specified pixel format.
 *
 * @param[in] c         color, ARGB-8888
 * @param[in] fmt       target pixel format
 *
 * @return              raw color value for the target pixel format, left
 *                      padded with zeros.
 *
 * @api
 */
dma2d_color_t dma2dFromARGB8888(dma2d_color_t c, dma2d_pixfmt_t fmt) {

  switch (fmt) {
  case DMA2D_FMT_ARGB8888: {
    return c;
  }
  case DMA2D_FMT_RGB888: {
    return (c & 0x00FFFFFF);
  }
  case DMA2D_FMT_RGB565: {
    return (((c & 0x000000F8) >> ( 8 -  5)) |
            ((c & 0x0000FC00) >> (16 - 11)) |
            ((c & 0x00F80000) >> (24 - 16)));
  }
  case DMA2D_FMT_ARGB1555: {
    return (((c & 0x000000F8) >> ( 8 -  5)) |
            ((c & 0x0000F800) >> (16 - 10)) |
            ((c & 0x00F80000) >> (24 - 15)) |
            ((c & 0x80000000) >> (32 - 16)));
  }
  case DMA2D_FMT_ARGB4444: {
    return (((c & 0x000000F0) >> ( 8 -  4)) |
            ((c & 0x0000F000) >> (16 -  8)) |
            ((c & 0x00F00000) >> (24 - 12)) |
            ((c & 0xF0000000) >> (32 - 16)));
  }
  case DMA2D_FMT_L8: {
    return (c & 0x000000FF);
  }
  case DMA2D_FMT_AL44: {
    return (((c & 0x000000F0) >> ( 8 - 4)) |
            ((c & 0xF0000000) >> (32 - 8)));
  }
  case DMA2D_FMT_AL88: {
    return (((c & 0x000000FF) >> ( 8 -  8)) |
            ((c & 0xFF000000) >> (32 - 16)));
  }
  case DMA2D_FMT_L4: {
    return (c & 0x0000000F);
  }
  case DMA2D_FMT_A8: {
    return ((c & 0xFF000000) >> (32 - 8));
  }
  case DMA2D_FMT_A4: {
    return ((c & 0xF0000000) >> (32 - 4));
  }
  default:
    osalDbgAssert(false, "invalid format");
    return 0;
  }
}

/**
 * @brief   Convert to ARGB-8888.
 * @details Converts color of the specified pixel format to an ARGB-8888 color.
 *
 * @param[in] c         color for the source pixel format, left padded with
 *                      zeros.
 * @param[in] fmt       source pixel format
 *
 * @return              color in ARGB-8888 format
 *
 * @api
 */
dma2d_color_t dma2dToARGB8888(dma2d_color_t c, dma2d_pixfmt_t fmt) {

  switch (fmt) {
  case DMA2D_FMT_ARGB8888: {
    return c;
  }
  case DMA2D_FMT_RGB888: {
    return ((c & 0x00FFFFFF) | 0xFF000000);
  }
  case DMA2D_FMT_RGB565: {
    register dma2d_color_t output = 0xFF000000;
    if (c & 0x001F) output |= (((c & 0x001F) << ( 8 -  5)) | 0x00000007);
    if (c & 0x07E0) output |= (((c & 0x07E0) << (16 - 11)) | 0x00000300);
    if (c & 0xF800) output |= (((c & 0xF800) << (24 - 16)) | 0x00070000);
    return output;
  }
  case DMA2D_FMT_ARGB1555: {
    register dma2d_color_t output = 0x00000000;
    if (c & 0x001F) output |= (((c & 0x001F) << ( 8 -  5)) | 0x00000007);
    if (c & 0x03E0) output |= (((c & 0x03E0) << (16 - 10)) | 0x00000700);
    if (c & 0x7C00) output |= (((c & 0x7C00) << (24 - 15)) | 0x00070000);
    if (c & 0x8000) output |= 0xFF000000;
    return output;
  }
  case DMA2D_FMT_ARGB4444: {
    register dma2d_color_t output = 0x00000000;
    if (c & 0x000F) output |= (((c & 0x000F) << ( 8 -  4)) | 0x0000000F);
    if (c & 0x00F0) output |= (((c & 0x00F0) << (16 -  8)) | 0x00000F00);
    if (c & 0x0F00) output |= (((c & 0x0F00) << (24 - 12)) | 0x000F0000);
    if (c & 0xF000) output |= (((c & 0xF000) << (32 - 16)) | 0x0F000000);
    return output;
  }
  case DMA2D_FMT_L8: {
    return (c & 0xFF) | 0xFF000000;
  }
  case DMA2D_FMT_AL44: {
    register dma2d_color_t output = 0x00000000;
    if (c & 0x0F) output |= (((c & 0x0F) << ( 8 - 4)) | 0x0000000F);
    if (c & 0xF0) output |= (((c & 0xF0) << (32 - 8)) | 0x0F000000);
    return output;
  }
  case DMA2D_FMT_AL88: {
    return (((c & 0x00FF) << ( 8 -  8)) |
            ((c & 0xFF00) << (32 - 16)));
  }
  case DMA2D_FMT_L4: {
    return ((c & 0x0F) | 0xFF000000);
  }
  case DMA2D_FMT_A8: {
    return ((c & 0xFF) << (32 - 8));
  }
  case DMA2D_FMT_A4: {
    return ((c & 0x0F) << (32 - 4));
  }
  default:
    osalDbgAssert(false, "invalid format");
    return 0;
  }
}

#endif  /* DMA2D_NEED_CONVERSIONS */

/** @} */

/** @} */

#endif  /* STM32_DMA2D_USE_DMA2D */
